var politics = {
    select: [
        { top: `1. 我们只能做三件事：
    郑重选择， 争取不留下遗憾； 如果有遗憾， 就理智地面对它， 然后争取改变； 假若也不能改变， 就勇敢地接受， 不要后悔， 继续朝前走。` },
        { top: `2. "反省"
    也叫 "反思", 是哲学所特有的一种思考方式， 哲学也可以说是一种反思的智慧。` },
        { top: `3. 哲学为什么有这样神奇的效力呢？ 应该说主要是两个原因。 意识哲学本身的原谅， 二是学习者用什么方法学习哲学。
    第一， 以学习和掌握辩证唯物主义和历史唯物主义的基本观点为基础。
    第二， 以运用马克思主义哲学基本观点提高分析和解决人生问题的能力为目的。
    第三， 用哲学引导人生， 用人生体验哲学。
    第四， 既注重学基础知识和人生哲学基础知识的完整性， 又注重贴近学生， 面向学生的人生实际问题。` },
        { top: `4. 人生选择不能只靠主观意志：
    人生选择体现了人的主观意志和愿望， 体现了人的价值追求。` },
        { top: `5. 想问题做事情必须从客观实际出发：
    一切从实际出发、 实事求是是做好各项事情的基本要求、 前提和依据。` },
        { top: `6. 根据客观实际选择人生道路：
    人生是在一定的时间和空间内的生命运动过程。` },
        { top: `7. 人生发展不能光说不动：
    人生目的和理想都需要通过自己的行动才能实现。 每一个人的人生都是由一连串的行动构成的， 行动是人运用自己的体力和智力实现目的和理想的过程，
    是使用现实的物质力量改变对象的过程， 也是人的内在精神、 道德力量的展现过程。` },
        { top: `8. 运动是物质的存在方式：
    人的存在和发展离不开人生行动， 不存在不行动的人生。` },
        { top: `9. 人生贵在立即行动：
    立即行动， 是对自己生命的珍惜。 立即行动， 就要积极进取， 敢于行动。， 就要运用规律， 善于行动。 要善于学会在行动中发现事物运动的规律` },
        { top: `10. 敢于行动不等于成功行动：
    行动成功要有明确的行动目的， 有恰当的行动方法和行动的条件` },
        { top: `11. 物质运动是有规律的：
    规律是事物运动过程中固有的、 本质的、 必然的、 稳定的联系。` },
        { top: `12. 人生行动的基本要素有：
    行动的主体、 行动的对象和行动的手段。` },
        { top: `13. 把握规律， 善于行动：
    我们要善于行动， 就要把握规律， 掌握方法， 学会做事， 克服盲目性。` },
        { top: `14. 自觉能动性的表现：
    自觉能动性是人特有的能力， 是人区别于动物的根本特点。 人的自觉能动性， 还表现在人能动地改造世界。` },
        { top: `15. 自强自立， 创造人生：
    发挥自觉能动性、 创造人生， 要学会自立。 独立面对人生， 自强不息。` },
        { top: `16. 客观规律与自觉能动性的辩证关系：
    客观规律与自觉能动性是辩证统一的。 一方面， 尊重客观规律是正确发挥主观能动性的基础前提。` },
        { top: `17. 脚踏实地、 积极进取， 走好人生每一步：
    需要有顽强毅力、 自强不息。` },
        { top: `18. 人不能孤立封闭地生存和发展：
 人际交往是个人身心健康的需要。 如果缺少人际交往， 没有与他人的交流和沟通， 会增加学习、 工作中的困难与挫折， 还会引发内心的矛盾与冲突， 从而带来一系列不良的情绪反应` },
        { top: `19. 联系的普遍性、 客观性要求我们：
    第一， 要用普遍联系的观点看问题，
    反对孤立地、 片面地看问题。 看问题不能只见树木， 不见森林； 只知其一， 不知其二； 改其一点， 不及其余。
    第二， 要从整体把握事物的联系， 处理好局部和整体的关系。
    第三， 要把握事物的客观联系， 反对主观臆造的联系` },
        { top: `20. 学会共处， 营造和谐人际关系：
    学会与人和谐共处是人生的一个重要的能力。` },
        { top: `21. 发展的实质和状态：
    发展的实质是新事物代替旧事物。 唯物辩证法认为。` }
    ],
    table: { select: '全部' }
}