var yw = {
    xz: [{
        top: '1. 下列各项中加点的字，读音不正确的一项是',
        option: [
            ['A. 淤泥(ni) 皓月(hao) 丝绦(tao)'],
            ['B. 恬美(tiao) 干瘪(bie) 涟漪(yi)'],
            ['C. 坎坷(kan) 咀爵(ju) 毅力(yi)'],
            ['D. 皱眉(zou) 葡萄(pu) 寄托(qi)']
        ],
        get answer() { return this.option[gets('D')] }
    }, {
        top: '2.下列各项中，有错别字的一项是',
        option: [
            ['A. 悠扬 娟娟细流'],
            ['B. 浓缩 包罗万象'],
            ['C. 跋涉 芸芸众生'],
            ['D. 岔路 名垂青史']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '3. 依次填入划横线空白处的词语，最恰当的一项是',
        option: [
            ['A. 享受 寄托'],
            ['B. 享用 托付'],
            ['C. 享受 托付'],
            ['D. 享用 托付']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '4. 下列对各句所使用的修辞手法的判断，错误的一项是',
        option: [
            ['A. 人生自古谁无死，留取丹心照汗青。(反问)'],
            ['B. 那点薄雪好像忽然害了羞，微微露出点儿粉色。(比喻，拟人)'],
            ['C. 怎样才能把一种劳作做到圆满呢？唯一的秘诀就是忠实。(设问)'],
            ['D. 鼓动吧，风！咆哮吧，雷！闪耀吧，电！把一切沉睡在黑暗怀里的东西，毁灭，毁灭，毁灭呀！(排比，反复)']
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: '5. 下列各项中加点成语的使用，不恰当的一项是',
        option: [
            ['A. 各地应该重视人才，让人才迸发出创新的活力，让人才饱食终日，尽展其长'],
            ['B. 听闻您儿子在全国作文竞赛中妙笔生花，获得大奖，我们特来表示祝贺'],
            ['C. 科学家袁隆平长期深入水稻生产实际，持之以恒地进行科学研究，这种敬业奉献精神得到社会的高度评价'],
            ['D. 专家称中国可燃冰开采成功的消息在全世界引起爆炸波，果不其然，这几天整个世界炸开了锅']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '6. 依次填入划横线空白处的语句，最恰当的一项是',
        option: [
            ['A. 1,3,2'],
            ['B. 3,2,1'],
            ['C. 3,1,2'],
            ['D. 2,1,3']
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: '1. 下列各项中加点的字，读音不正确的一项是',
        option: [
            ['A. 遏制(e) 激情(ji) 飓风(ju)'],
            ['B. 肆意(shi) 濒临(bing) 边缘(yuan)'],
            ['C. 欢愉(yu) 牺牲(xi) 孤寂(ji)'],
            ['D. 俯瞰(kan) 深渊(yuan) 缩影(suo)']
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: '2. 下列各项中，有错别字的一项是',
        option: [
            ['A. 解除 深不可测'],
            ['B. 嘲讽 无能为力'],
            ['C. 呼毫 深受奇害'],
            ['D. 不幸 斗转星移']
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '3. 依此填入划横线空白处的词语，最恰当的一项是 例句：我希望知道星星为什么闪闪发光，我  理解毕达哥拉斯的思想威力',
        option: [
            ['A. 试图 支配'],
            ['B. 试图 支使'],
            ['C. 企图 支使'],
            ['D. 企图 支配']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '4. 下列各句中，加点的成语使用不恰当的一项是',
        option: [
            ['A. 唐雎这种凛然不可侵犯的独立人格和自强的精神，在历史的长河中一直熠熠生辉'],
            ['B. 虽然当年我们是同窗，可现在他的学问很高，我是万尘莫及了'],
            ['C. 敌人对江姐用尽酷刑还是一无所获，最后也无能为力了'],
            ['D. 探索的过程不是消极的袖手旁观，而需要有想象力的有计划地探索']
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: `5. 依次填入划横线空白处的语句，最恰当的一项是，
        例句:这次经历，使我明白了一个道理：——————,——————,—————— 所以，我要不断地告诫自己：面对生活中的机遇，千万不要错过。`,
        option: [
            ['A. 4，1，3，2'],
            ['B. 1,3,2,4'],
            ['C. 4,2,1,3'],
            ['D. 1,3,4,2']
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: `6. 下列例句运用的主要修辞手法是,
        例句：母爱是温暖心灵的太阳，母爱是滋润心灵的雨露，母爱是灌溉心灵的沃土，母爱是美化心灵的彩虹`,
        option: [
            ['A. 夸张'],
            ['B. 拟人'],
            ['C. 排比'],
            ['D. 设问']
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '1.下列各项中加点的字，读音不正确的一项是',
        option: [
            ['A. 讨教(tao) 透露(lu) 采访(fang)'],
            ['B. 典礼(dian) 延续(yan) 爽快(shuang)'],
            ['C. 飒爽(sha) 身躯(ju) 芸芸(yun)'],
            ['D. 爆发(bao) 模样(mu) 稿纸(gao)']
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '2. 下列各组词语中，书写正确的一项是',
        option: [
            ['A. 身躯 感慨 嶙峋 雄心勃勃'],
            ['B. 爆发 妖娆 取缔 白发沧沧'],
            ['C. 魅力 惊讶 典籍 重峦叠嶂'],
            ['D. 推崇 犹豫 恻隐 飒爽英姿']
        ],
        get answer() { return this.option[gets('D')] }
    }, {
        top: `3. 依次填入划横线空白处的词语，最恰当的一项是
        例句：卡萨尔斯面对  的年轻人，  地回答：先成为优秀而大写的人，然后成为一名优秀而大写的音乐人，最后成为一名优秀的大提琴家`,
        option: [
            ['A. 雄心勃勃 意味深长'],
            ['B. 心灰意冷 意味深长'],
            ['C. 心灰意冷 深入浅出'],
            ['D. 雄心勃勃 深入浅出']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '4. 下列各项中加点成语的使用，恰当的一项是',
        option: [
            ['A. 为了看日出步登山队队员趁着夜色早早爬上泰山山顶。他们登峰造极的精神真让人钦佩'],
            ['B. 五星花园四周的建筑鳞次栉比，在夜晚灯光的映衬下，尽显城市别样风情'],
            ['C. 作案者周密的谋划和熟练的手法相得益彰，使得案情扑朔迷离，增大了侦破的难度'],
            ['D. 留守学生普遍存在内向胆怯，自我封闭等心理问题，许多外出务工家长却不以为然']
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: `5. 依次填入划横线空白处的语句，最恰当的一项是 
        例句：我带着孩子们，隐身在走廊的玻璃门里，悄悄观望`,
        option: [
            ['A. 3,1,2,4'],
            ['B. 3,2,1,4'],
            ['C. 2,3,4,1'],
            ['D. 2,4,3,1']
        ],
        get answer() { return this.option[gets('D')] }
    }, {
        top: `6.下列例句运用的主要修辞手法是：
        怎样才能成为一个优秀的主持人呢？心中有个声音在回答：先成为优秀的人，然后成为一个优秀的新闻人，再然后是自然地成为一名优秀的节目主持人`,
        option: [
            ['A. 设问'],
            ['B. 比喻'],
            ['C. 拟人'],
            ['D. 夸张']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '1. 下列各项中加点的字，读音不正确的一项是',
        option: [
            ['A. 倏忽(shu) 迸发(beng) 蒙蔽(bi)'],
            ['B. 藐视(miao) 废墟(xu) 仓促(cang)'],
            ['C. 啃啮 钦佩(qing) 吮吸(shun)'],
            ['D. 炫耀(xuan) 厌倦(juan) 衡量(heng)']
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '2. 下列各组词语中，书写无误的一项是',
        option: [
            ['A. 遵循 安份 贬低 蓦然回首'],
            ['B. 窍门 胸膛 领域 兢兢业业'],
            ['C. 贸然 卓跃 牺牲 炫彩夺目'],
            ['D. 厌倦 赐予 土壤 至始至终']
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: '3. 下列句子中，加点的词语使用不正确的一项是',
        option: [
            ['A. 对于某些人在公众场合的不文明举止，我们不能听天由命'],
            ['B. 当时由于条件艰苦，我梦寐以求的上大学的愿望始终未能实现'],
            ['C. 这幅画饱含诗情'],
            ['D. 邓稼先是中华名族核武器事业的奠基人和开拓者。张爱萍将军称他为“‘两弹’元勋”']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '4. 一个有——————的人，是能正确对待自己的人，是追求自我完善的人，也必定是一个————————',
        option: [
            ['A. 自知之明 自强不息'],
            ['B. 自知之明 卧薪尝胆'],
            ['C. 知人者智 卧薪尝胆'],
            ['D. 知人者智 自强不息']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '5. 下列语句排序最恰当的一项是',
        option: [
            ['A. 1,5,4,2,3'],
            ['B. 1,5,3,2,4'],
            ['C. 2,4,1,5,3'],
            ['D. 3,2,4,1,5']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '1. 下列各项中加点的字，读音不正确的一项是',
        option: [
            ['A. 结语(jie) 岗位(gang) 实话(shi)'],
            ['B. 天分(fen) 奖励(li) 体系(xi)'],
            ['C. 世俗(shu) 优越(yue) 分散(sang'],
            ['D. 著作(zhu) 甭说(beng) 配角(jue)']
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '2. 下列各项中，有错别字的一项是',
        option: [
            ['A. 茶叶 安分守己'],
            ['B. 界定 格格不入'],
            ['C. 实验 原封不动'],
            ['D. 务实 壮志凌云']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '3. 依次填入划横线空白处的词语，最恰当的一项是：大学的文科____往往会令许多人从骨子里更喜欢那种激动人心的时刻和时代，甚至使人_____起来',
        option: [
            ['A. 教育 膨胀'],
            ['B. 教学 肿胀'],
            ['C. 教育 肿胀'],
            ['D. 教学 膨胀']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '4. 下列填入横线处的语句，与下文衔接最恰当的一项是：______。父母对子女有抚养的义务，子女又对父母赡养之责任;个人对社会有奉献的责任，同时社会也有对个人的责任',
        option: [
            ['A. 我们要做有责任的人'],
            ['B. 人与人之间都要有责任'],
            ['C. 责任是无处不在的'],
            ['D. 责任常常是双向的']
        ],
        get answer() { return this.option[gets('D')] }
    }, {
        top: '5. 下列各项中加点成语的使用，不恰当的一项是',
        option: [
            ['A. 伟大的科学家霍金与世长辞，这一突如其来的消息，迅速刷爆了朋友圈'],
            ['B. 长江大保护必须从大处着眼小处着手，这是毋庸置疑'],
            ['C. 外卖小哥雷海为勇夺第三季《中国诗词大会》冠军，真令人叹为观止'],
            ['D. 钢珠澳大桥因综合技术难度首屈一指，被陈为全球最具有挑战的跨海大桥']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '6. 下列例句运用的主要修辞手法是：是什么引起这儿的骚动呢？是台风，是惊涛骇浪',
        option: [
            ['A. 设问'],
            ['B. 夸张'],
            ['C. 比喻'],
            ['D. 排比']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '1.下列各项加点的字，读音不正确的一项是',
        option: [
            ['A.淡泊（po） 放射（she） 铀盐（you）'],
            ['B.贝壳（ke） 海滩（tan） 提炼（lian）'],
            ['C.废弃（fei) 木棚（peng）荧光（ying）'],
            ['D.积攒（zan）盔甲（kui） 凛然（lin）'],
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '2.下列各项中，有错别字的一项是',
        option: [
            ['A.盛名 实事求是'],
            ['B.鼎沸 一如即往'],
            ['C.端庄 精修细研'],
            ['D.长裙 超凡脱俗'],
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: `3.依次填入画横线空白处的词语，最恰当的一项是
        居里夫人的美名从她发镭那一刻起就——————于世，迄今已经百年，这是她用全部的青春，信念和生命换来的——————。`,
        option: [
            ['A.流传 名誉'],
            ['B.流传 荣誉'],
            ['C.留传 名誉'],
            ['D.留传 荣誉'],
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: `4.下列句子排列顺序正确的一项是
        1.唯有对自己的人生负责，他才有可能自觉地选择和承担起对他人和社会的责任。
        2.相反，一个不爱人生的人怎么会爱他人的事业？
        3.正如歌德所说：“责任就是对自己的要求去做的事情有一种爱。
        4.因为这种爱，所以负责本身就成了生命意义的一种实现，就能从中获得心灵的满足”`,
        option: [
            ['A.51342'],
            ['B.51243'],
            ['C.52134'],
            ['D.53124'],
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: `5.下面文段中画线词语的使用，不恰当的一项是
        甘肃平凉的崆峒山，集奇险灵秀的自然景观和古朴精湛的人文景观于一身。
        峰峦雄奇，危崖耸立，似鬼斧神工;林海浩瀚,烟笼雾锁，如缥渺仙境;高峡平湖，水天一色，有漓江神韵。
        凝重典雅的八台九宫十二院，四十二座建筑群，七十二处石府洞天，器宇轩昂。底蕴丰厚。`,
        option: [
            ['A.奇险灵秀'],
            ['B.水天一色'],
            ['C.凝重典雅'],
            ['D.器宇轩昂'],
        ],
        get answer() { return this.option[gets('D')] }
    }, {
        top: `6.下列例句运用的主要修辞手法是
        [例句]器字轩吊、容貌高雅的喜鹊，吱喳的鸣叫声略带金属质感，又不失婉转，再之让人心说。`,
        option: [
            ['A.拟人'],
            ['B.反问'],
            ['C.排比'],
            ['D.夸张'],
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '1.下列各组词语中，加点字的注音不正确的一-项是',
        option: [
            ['A.瞬间(shun) 寥廊(liao) 浑身解数(xie)'],
            ['B.确凿( zao) 百舸( ge ) 亢奋( kang  )'],
            ['C.提携( xie) 狼藉( jie) 根深蒂固(di )'],
            ['D.恻隐( ce ) 禁锢( gu ) 为虎作伥(wei)'],
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '2.下列各组词语中，书写无误的一组是',
        option: [
            ['A.竞然 轮郭 花样年华'],
            ['B.浮躁 凋零 怒不可遏'],
            ['C.翱翔 俊俏 义气风发'],
            ['D.仓茫 激荡 指点迷今'],
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: '3.下列诗句中,不属于对偶句的一项是',
        option: [
            ['A鹰击长空，鱼翔浅底'],
            ['B.两个黄鹂鸣翠柳，行白鹭上青天'],
            ['C.相见时难别亦难,东风无力百花残'],
            ['D.远看山有色，近听水无声'],
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '4.下列诗句朗读节奏不正确的一项是',
        option: [
            ['A.天/将/降/大任/于/是人也'],
            ['B.居/庙堂之高/则优其民，处/江潮之远则优其若'],
            ['C.指点/江山，激扬/文字,粪土/当年1/万/户侯'],
            ['D.若夫/日出/而/林霏开'],
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '5.诗词讲究炼字，下面有关炼字的解说不正确一项是',
        option: [
            ['A.“随风潜人夜，润物细无声,一个"潜"字形象生动地描写出了雨水在黑夜中偷偷来到'],
            ['B.“红杏枝头春意闹”中“闹”是诗眼”把春意盎然、生机勃勃的美景表现了 出来。'],
            ['C.“万山红遍,层林尽染”中乐营染”字写出了树林经霜变红的均匀鲜艳及横扫-一切的气势。'],
            ['D.“春风又绿江南岸”,诗眼是“又”写出了冬去春来的喜悦。'],
        ],
        get answer() { return this.option[gets('D')] }
    }, {
        top: '6.下列对文化常识的表述，不正确的一项是',
        option: [
            ['A.《沁园春.雪)写于1925年秋。'],
            ['B.学官,古代主管学务的官员和官学教;师的统称。'],
            ['C.金榜,古代科举制度股试后录取进士揭晓名次的布告。'],
            ['D.万户侯,汉代设置的一- 种高级爵位'],
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '1.下列各项中加点的字，读音不正确的一项是',
        option: [
            ['A.盛放(cheng) 肢体(zhi) 伴侣(lu)'],
            ['B.污浊(zuo) 祥和(huo) 销毁(xiao)'],
            ['C.濡养(ru) 赘物(zhui) 挟持(xie) '],
            ['D.耗费(hao)嘹亮(liao) 沼泽(zhao)'],
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: '2.下列各项中，有错别字的一项是',
        option: [
            ['A.小觑 月冷风清'],
            ['B.灼晕 净手焚香'],
            ['C.流程 鸡飞狗跳'],
            ['D.捆厄 抽思剥茧'],
        ],
        get answer() { return this.option[gets('D')] }
    }, {
        top: '3.下列加点成语使用错误的一项是',
        option: [
            ['A.真正的朋友之间，应该间不容发，关系密切如一人。'],
            ['B.警察一时疏忽，错抓了罪犯的弟弟，以致发生李代桃僵的情形。'],
            ['C.作者怀着激动的心情写下了这篇行云流水、洋洋洒洒的文章。'],
            ['D.整个科研过程他都没有参与，最后却鸠占鹊巢，把功劳归为己有。'],
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: `4.依次填人画横线空白处的词语，最恰当的一项是
        人的肢体活动，需要——————。人的——————活动，也需要空间. `,
        option: [
            ['A.空间 心灵'],
            ['B.空地 灵魂'],
            ['C.空间 灵魂'],
            ['D.空地 心灵'],
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: `5.填人画横线空白处的语句,最恰当的一项是
        工程是一把双刃剑——————。
        但设计合理、创意新颖的工程外观，不仅不是环境的破坏，反而是环境的美化。`,
        option: [
            ['A.一方面，它是环境建设;另一方面，它又是对环境的破坏'],
            ['B.一方面，它是环境建造;另-方面， 它又是对环境 的损坏'],
            ['C.一方面，它是对环境的破坏;另-方面,它又是环境建设'],
            ['D.一方面，它是对环境的损坏;另一方 面，它又是环境建造'],
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: `6.下列例句运用的主要修辞手法是
        [例句]每条岭都是那么的温柔，虽然下自山脚，上至岭顶，长满了珍贵的林木，可是谁也不峰突起，盛气凌人。`,
        option: [
            ['A.拟人'],
            ['B.夸张'],
            ['C.对比'],
            ['D.反复'],
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '1.下列各项中加点的字，读音不正确的一项是',
        option: [
            ['A.屏障(ping) 旷野(kuang) 邈远(miao)'],
            ['B.庇护(bi) 突兀(wu) 一隅(yu)'],
            ['C.惊悸(qi) 汨汨(gu) 沉着(zuo)'],
            ['D.修缮(shan)履历(lu)  胡逛( guang)'],
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '2.下列各项中,有错别字的一项是',
        option: [
            ['A.骚动 痛哭流涕'],
            ['B.炮哮 颓璧残垣'],
            ['C.强悍 旱涝无常'],
            ['D.踊跃 怦然心动'],
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: `3.依次填人下列句子横线处的关联词，最恰当的一项是
        1.——————说，长城占据的是辽阔的空间，，它却实实在在地占据了邈远的时间。
        2.长城——————是古代军事防御工程，———————是巧夺天工的文化景观。`,
        option: [
            ['A.虽然 但是 既 又'],
            ['B.如果 那么 既不 也不'],
            ['C.如果 那么 不仅 还'],
            ['D.虽然 但是 由于 因此'],
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '4.下列诗句中，与长城无关的一句是',
        option: [
            ['A.山舞银蛇，原驰蜡象，欲与天公试比高。'],
            ['B.高阙银为阙，长城玉作城。'],
            ['C.秦筑长城比铁牢，蕃戎不敢过临洮'],
            ['D.长波逐若泻,连山凿如劈。'],
        ],
        get answer() { return this.option[gets('D')] }
    }, {
        top: '5.下面句子中的标点符号,，使用不正确的一项是',
        option: [
            ['A.从长远看,不仅读书写字需要态度端正严谨认真，我们做任何事情何尝不是如此?'],
            ['B.秦始皇筑长城的指令,雄壮蛮吓残忍,他筑堰的指令,智慧、仁慈、透明。'],
            ['C.“好吧。”他说，“我相信你能行!”'],
            ['D.新城区的立体斑马线视觉效果神奇:远远看去，仿佛一个个长方体凸起在地面上。'],
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: `6.填入下面一段文字横线上的语句，最恰当的一项是
        据报道，古长城现状堪忧，不少地段的长城淹没在杂草、乱石之中，甚至被人为损坏。
        国家文物局公布的数据显示，——————，超过七成保存状况较差。`,
        option: [
            ['A.即使距今年代最近的明长城，虽然有8%的墙体保存完好'],
            ['B.只有8%的墙体保存完好的明长城，是距今年代最近的长城'],
            ['C.即使距今年代最近的明长城，也只有8%的墙体保存完好'],
            ['D.明代长城虽然距今年代最近,但也只有8%的墙体保存完好'],
        ],
        get answer() { return this.option[gets('C')] }
    }],
    gs: [{ top: `沁园春·长沙
    [现代] 毛泽东
    独立寒秋，湘江北去，橘子洲头。
    看万山红遍，层林尽染；
    漫江碧透，百舸争流。
    鹰击长空，鱼翔浅底，
    万类霜天竞自由。
    怅寥廓，问苍茫大地，谁主沉浮？
    
    携来百侣曾游，
    忆往昔峥嵘岁月稠。
    恰同学少年，风华正茂；
    书生意气，挥斥方遒。
    指点江山，激扬文字，
    粪土当年万户侯。
    曾记否，到中流击水，浪遏飞舟！` }],
    table: {
        xz: '选择',
        gs: '古诗'
    }
}