var yw = {
    xz: [{
        top: '1. 下列各项中加点的字，读音不正确的一项是',
        option: [
            ['A. 淤泥(ni) 皓月(hao) 丝绦(tao)'],
            ['B. 恬美(tiao) 干瘪(bie) 涟漪(yi)'],
            ['C. 坎坷(kan) 咀爵(ju) 毅力(yi)'],
            ['D. 皱眉(zou) 葡萄(pu) 寄托(qi)']
        ],
        get answer() { return this.option[gets('D')] }
    }, {
        top: '2.下列各项中，有错别字的一项是',
        option: [
            ['A. 悠扬 娟娟细流'],
            ['B. 浓缩 包罗万象'],
            ['C. 跋涉 芸芸众生'],
            ['D. 岔路 名垂青史']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '3. 依次填入划横线空白处的词语，最恰当的一项是',
        option: [
            ['A. 享受 寄托'],
            ['B. 享用 托付'],
            ['C. 享受 托付'],
            ['D. 享用 托付']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '4. 下列对各句所使用的修辞手法的判断，错误的一项是',
        option: [
            ['A. 人生自古谁无死，留取丹心照汗青。(反问)'],
            ['B. 那点薄雪好像忽然害了羞，微微露出点儿粉色。(比喻，拟人)'],
            ['C. 怎样才能把一种劳作做到圆满呢？唯一的秘诀就是忠实。(设问)'],
            ['D. 鼓动吧，风！咆哮吧，雷！闪耀吧，电！把一切沉睡在黑暗怀里的东西，毁灭，毁灭，毁灭呀！(排比，反复)']
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: '5. 下列各项中加点成语的使用，不恰当的一项是',
        option: [
            ['A. 各地应该重视人才，让人才迸发出创新的活力，让人才饱食终日，尽展其长'],
            ['B. 听闻您儿子在全国作文竞赛中妙笔生花，获得大奖，我们特来表示祝贺'],
            ['C. 科学家袁隆平长期深入水稻生产实际，持之以恒地进行科学研究，这种敬业奉献精神得到社会的高度评价'],
            ['D. 专家称中国可燃冰开采成功的消息在全世界引起爆炸波，果不其然，这几天整个世界炸开了锅']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '6. 依次填入划横线空白处的语句，最恰当的一项是',
        option: [
            ['A. 1,3,2'],
            ['B. 3,2,1'],
            ['C. 3,1,2'],
            ['D. 2,1,3']
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: '1. 下列各项中加点的字，读音不正确的一项是',
        option: [
            ['A. 遏制(e) 激情(ji) 飓风(ju)'],
            ['B. 肆意(shi) 濒临(bing) 边缘(yuan)'],
            ['C. 欢愉(yu) 牺牲(xi) 孤寂(ji)'],
            ['D. 俯瞰(kan) 深渊(yuan) 缩影(suo)']
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: '2. 下列各项中，有错别字的一项是',
        option: [
            ['A. 解除 深不可测'],
            ['B. 嘲讽 无能为力'],
            ['C. 呼毫 深受奇害'],
            ['D. 不幸 斗转星移']
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '3. 依此填入划横线空白处的词语，最恰当的一项是 例句：我希望知道星星为什么闪闪发光，我  理解毕达哥拉斯的思想威力',
        option: [
            ['A. 试图 支配'],
            ['B. 试图 支使'],
            ['C. 企图 支使'],
            ['D. 企图 支配']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '4. 下列各句中，加点的成语使用不恰当的一项是',
        option: [
            ['A. 唐雎这种凛然不可侵犯的独立人格和自强的精神，在历史的长河中一直熠熠生辉'],
            ['B. 虽然当年我们是同窗，可现在他的学问很高，我是万尘莫及了'],
            ['C. 敌人对江姐用尽酷刑还是一无所获，最后也无能为力了'],
            ['D. 探索的过程不是消极的袖手旁观，而需要有想象力的有计划地探索']
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '5. 依次填入划横线空白处的语句，最恰当的一项是',
        option: [
            ['A. 4，1，3，2'],
            ['B. 1,3,2,4'],
            ['C. 4,2,1,3'],
            ['D. 1,3,4,2']
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '6. 下列例句运用的主要修辞手法是,例句：母爱是温暖心灵的太阳，母爱是滋润心灵的雨露，母爱是灌溉心灵的沃土，母爱是美化心灵的彩虹',
        option: [
            ['A. 夸张'],
            ['B. 拟人'],
            ['C. 排比'],
            ['D. 设问']
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '1.下列各项中加点的字，读音不正确的一项是',
        option: [
            ['A. 讨教(tao) 透露(lu) 采访(fang)'],
            ['B. 典礼(dian) 延续(yan) 爽快(shuang)'],
            ['C. 飒爽(sha) 身躯(ju) 芸芸(yun)'],
            ['D. 爆发(bao) 模样(mu) 稿纸(gao)']
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '2. 下列各组词语中，书写正确的一项是',
        option: [
            ['A. 身躯 感慨 嶙峋 雄心勃勃'],
            ['B. 爆发 妖娆 取缔 白发沧沧'],
            ['C. 魅力 惊讶 典籍 重峦叠嶂'],
            ['D. 推崇 犹豫 恻隐 飒爽英姿']
        ],
        get answer() { return this.option[gets('D')] }
    }, {
        top: '3. 依次填入划横线空白处的词语，最恰当的一项是 例句：卡萨尔斯面对  的年轻人，  地回答：先成为优秀而大写的人，然后成为一名优秀而大写的音乐人，最后成为一名优秀的大提琴家',
        option: [
            ['A. 雄心勃勃 意味深长'],
            ['B. 心灰意冷 意味深长'],
            ['C. 心灰意冷 深入浅出'],
            ['D. 雄心勃勃 深入浅出']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '4. 下列各项中加点成语的使用，恰当的一项是',
        option: [
            ['A. 为了看日出步登山队队员趁着夜色早早爬上泰山山顶。他们登峰造极的精神真让人钦佩'],
            ['B. 五星花园四周的建筑鳞次栉比，在夜晚灯光的映衬下，尽显城市别样风情'],
            ['C. 作案者周密的谋划和熟练的手法相得益彰，使得案情扑朔迷离，增大了侦破的难度'],
            ['D. 留守学生普遍存在内向胆怯，自我封闭等心理问题，许多外出务工家长却不以为然']
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: '5. 依次填入划横线空白处的语句，最恰当的一项是 例句：我带着孩子们，隐身在走廊的玻璃门里，悄悄观望',
        option: [
            ['A. 3,1,2,4'],
            ['B. 3,2,1,4'],
            ['C. 2,3,4,1'],
            ['D. 2,4,3,1']
        ],
        get answer() { return this.option[gets('D')] }
    }, {
        top: '6.下列例句运用的主要修辞手法是：怎样才能成为一个优秀的主持人呢？心中有个声音在回答：先成为优秀的人，然后成为一个优秀的新闻人，再然后是自然地成为一名优秀的节目主持人',
        option: [
            ['A. 设问'],
            ['B. 比喻'],
            ['C. 拟人'],
            ['D. 夸张']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '1. 下列各项中加点的字，读音不正确的一项是',
        option: [
            ['A. 倏忽(shu) 迸发(beng) 蒙蔽(bi)'],
            ['B. 藐视(miao) 废墟(xu) 仓促(cang)'],
            ['C. 啃啮 钦佩(qing) 吮吸(shun)'],
            ['D. 炫耀(xuan) 厌倦(juan) 衡量(heng)']
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '2. 下列各组词语中，书写无误的一项是',
        option: [
            ['A. 遵循 安份 贬低 蓦然回首'],
            ['B. 窍门 胸膛 领域 兢兢业业'],
            ['C. 贸然 卓跃 牺牲 炫彩夺目'],
            ['D. 厌倦 赐予 土壤 至始至终']
        ],
        get answer() { return this.option[gets('B')] }
    }, {
        top: '3. 下列句子中，加点的词语使用不正确的一项是',
        option: [
            ['A. 对于某些人在公众场合的不文明举止，我们不能听天由命'],
            ['B. 当时由于条件艰苦，我梦寐以求的上大学的愿望始终未能实现'],
            ['C. 这幅画饱含诗情'],
            ['D. 邓稼先是中华名族核武器事业的奠基人和开拓者。张爱萍将军称他为“‘两弹’元勋”']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '4. 一个有——————的人，是能正确对待自己的人，是追求自我完善的人，也必定是一个————————',
        option: [
            ['A. 自知之明 自强不息'],
            ['B. 自知之明 卧薪尝胆'],
            ['C. 知人者智 卧薪尝胆'],
            ['D. 知人者智 自强不息']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '5. 下列语句排序最恰当的一项是',
        option: [
            ['A. 1,5,4,2,3'],
            ['B. 1,5,3,2,4'],
            ['C. 2,4,1,5,3'],
            ['D. 3,2,4,1,5']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '1. 下列各项中加点的字，读音不正确的一项是',
        option: [
            ['A. 结语(jie) 岗位(gang) 实话(shi)'],
            ['B. 天分(fen) 奖励(li) 体系(xi)'],
            ['C. 世俗(shu) 优越(yue) 分散(sang'],
            ['D. 著作(zhu) 甭说(beng) 配角(jue)']
        ],
        get answer() { return this.option[gets('C')] }
    }, {
        top: '2. 下列各项中，有错别字的一项是',
        option: [
            ['A. 茶叶 安分守己'],
            ['B. 界定 格格不入'],
            ['C. 实验 原封不动'],
            ['D. 务实 壮志凌云']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '3. 依次填入划横线空白处的词语，最恰当的一项是：大学的文科____往往会令许多人从骨子里更喜欢那种激动人心的时刻和时代，甚至使人_____起来',
        option: [
            ['A. 教育 膨胀'],
            ['B. 教学 肿胀'],
            ['C. 教育 肿胀'],
            ['D. 教学 膨胀']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '4. 下列填入横线处的语句，与下文衔接最恰当的一项是：______。父母对子女有抚养的义务，子女又对父母赡养之责任;个人对社会有奉献的责任，同时社会也有对个人的责任',
        option: [
            ['A. 我们要做有责任的人'],
            ['B. 人与人之间都要有责任'],
            ['C. 责任是无处不在的'],
            ['D. 责任常常是双向的']
        ],
        get answer() { return this.option[gets('D')] }
    }, {
        top: '5. 下列各项中加点成语的使用，不恰当的一项是',
        option: [
            ['A. 伟大的科学家霍金与世长辞，这一突如其来的消息，迅速刷爆了朋友圈'],
            ['B. 长江大保护必须从大处着眼小处着手，这是毋庸置疑'],
            ['C. 外卖小哥雷海为勇夺第三季《中国诗词大会》冠军，真令人叹为观止'],
            ['D. 钢珠澳大桥因综合技术难度首屈一指，被陈为全球最具有挑战的跨海大桥']
        ],
        get answer() { return this.option[gets('A')] }
    }, {
        top: '6. 下列各项中加点成语的使用，不恰当的一项是：是什么引起这儿的骚动呢？是台风，是惊涛骇浪',
        option: [
            ['A. 设问'],
            ['B. 夸张'],
            ['C. 比喻'],
            ['D. 排比']
        ],
        get answer() { return this.option[gets('A')] }
    }],
    table: {
        xz: '选择'
    }
}